// Понятия Обьекта и Класса

package src;

public class l3l2Class {

    public static void main(String[] args) {
        // Добавим Обьект Класса Cat
//        Cat murka = new Cat();
//        murka.();

        //Можно ещё создать КЛАСС строку под именем name
        // и внем будет создно пустая строка
        String name = new String();
        //и у этой строки будет вызвано
        // меотод length которвя будет возврощять длину строки
        System.out.println(name.length());


//        JAVA - это строго типизированный Язык програмирования ЯП
//        ТИПЫ ПЕРЕМЕННЫХ - задаются четко явно и заранее
//        Мы всегда знаем какого Класса переменная


    }

}
